Config/Documents/ИнвентаризацияРасчетовПоПоступлениям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ИнвентаризацияРасчетовПоПоступлениям</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДолгосрочнаяПросроченнаяЗадолженность</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУчетаИФО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоПредседателяКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечататьОтбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоИнвентаризации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.МестоИнвентаризацииСтрока</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоКонтрагентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриказаКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриказаКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИнвентаризации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаключениеКомиссии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПодписиКомиссии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РешениеОПроведенииИнвентаризации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РешениеОПроведенииИнвентаризации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаполнения</Name>
					<Comment>0 - по контрагентам, 1 - по договорам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаполнятьКодЦели</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Задолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подтверждено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПодтверждено</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИстекСрокДавности</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгосрочная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Просроченная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаВозникновения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаИсполнения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОбразованияКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>2</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОбразованияПояснение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОбразованияДополнительно</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокСчетов</Name>
					<Comment>Счета, по которым производится отбор при заполнении по данным учета.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.ЕПСБУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СписокКонтрагентов</Name>
					<Comment>Контрагенты, по которым производится отбор при заполнении по данным учета.</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКомиссии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДолжностьЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФамилияЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтчествоЧленаКомиссии</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ВидыЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Дебиторская</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредиторская</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчетнаяГруппа</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ИнвентаризацияРасчетовПоПоступлениям/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокСчетовПоУмолчанию(ДокументОбъект) Экспорт
	
	СписокСчетовПоУмолчанию = ПолучитьСписокСчетовПоУмолчанию();
	
	ТабличнаяЧасть = ДокументОбъект["СписокСчетов"];
	
	ТабличнаяЧасть.Очистить();
	
	Для Каждого Счет Из СписокСчетовПоУмолчанию Цикл
		НоваяСтрока = ТабличнаяЧасть.Добавить();
		НоваяСтрока["Счет"] = Счет;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПоДаннымУчета(ДокументОбъект, РежимЗаполнения) Экспорт
	
	ДатаОпределенияОстатков	= ИнвентаризацияКлиентСервер.ПолучитьДатуОпределенияОстатков52н(ДокументОбъект.ДатаИнвентаризации);
	
	СписокСчетов = ПолучитьМассивЗаполненныхЗначений(ДокументОбъект["СписокСчетов"], "Счет");
	
	СписокКонтрагентов = ПолучитьМассивЗаполненныхЗначений(ДокументОбъект["СписокКонтрагентов"], "Контрагент");
	
	ИспользоватьУчетПоПодразделениям = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям");
	
	ИспользоватьОтборПоПодразделению = ИспользоватьУчетПоПодразделениям И ЗначениеЗаполнено(ДокументОбъект["Подразделение"]);
	
	ИспользоватьОтборПоКонтрагенту = (СписокКонтрагентов.Количество() > 0);
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	
	ИспользоватьОтборПоИФО = ИспользоватьУчетПоИФО И ЗначениеЗаполнено(ДокументОбъект["ИФО"]);
	
	ИспользоватьОтборПоКФО = ЗначениеЗаполнено(ДокументОбъект["КФО"]);
	
	ЗапросЗаполнение = Новый Запрос();
	ЗапросЗаполнение.УстановитьПараметр("ДатаЗапроса",						ДатаОпределенияОстатков);
	ЗапросЗаполнение.УстановитьПараметр("СписокСчетов",						СписокСчетов);
	ЗапросЗаполнение.УстановитьПараметр("СписокКонтрагентов",				СписокКонтрагентов);
	ЗапросЗаполнение.УстановитьПараметр("Организация",						ДокументОбъект["Организация"]);
	ЗапросЗаполнение.УстановитьПараметр("Подразделение",					ДокументОбъект["Подразделение"]);
	ЗапросЗаполнение.УстановитьПараметр("ИФО",								ДокументОбъект["ИФО"]);
	ЗапросЗаполнение.УстановитьПараметр("КФО",								ДокументОбъект["КФО"]);
	ЗапросЗаполнение.УстановитьПараметр("ИспользоватьОтборПоПодразделению",	ИспользоватьОтборПоПодразделению);
	ЗапросЗаполнение.УстановитьПараметр("ИспользоватьОтборПоКонтрагенту",	ИспользоватьОтборПоКонтрагенту);
	ЗапросЗаполнение.УстановитьПараметр("ИспользоватьОтборПоИФО",			ИспользоватьОтборПоИФО);
	ЗапросЗаполнение.УстановитьПараметр("ИспользоватьОтборПоКФО",			ИспользоватьОтборПоКФО);
	ЗапросЗаполнение.УстановитьПараметр("ИспользоватьУчетПоИФО",			ИспользоватьУчетПоИФО);
	ЗапросЗаполнение.УстановитьПараметр("КЭК000",							БухгалтерскийУчетПовтИсп.КЭК0());
	ЗапросЗаполнение.УстановитьПараметр("ЗаполнятьКодЦели",					ДокументОбъект.ЗаполнятьКодЦели);
	ЗапросЗаполнение.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Отбор контрагентов
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Ссылка
	|ПОМЕСТИТЬ
	|	ОтборКонтрагентов
	|ИЗ
	|	Справочник.Контрагенты
	|ГДЕ
	|	Ссылка В ИЕРАРХИИ(&СписокКонтрагентов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Задолженность различная
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Счет													КАК Счет,
	|	Счет.Забалансовый										КАК СчетЗабалансовый,
	|	Счет.БезДетализацииКОСГУ								КАК СчетБезДетализацииКОСГУ,
	|	ВЫБОР
	|		КОГДА Счет.КОСГУКт = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) ТОГДА
	|			""0""
	|		ИНАЧЕ
	|			ПОДСТРОКА(Счет.КОСГУКт.Код, 3, 1)
	|	КОНЕЦ 													КАК СчетКИЕ,
	|	КФО														КАК КФО,
	|	КПС														КАК КПС,
	|	ВЫБОР
	|		КОГДА Счет.Забалансовый ТОГДА
	|			КЭК
	|		ИНАЧЕ
	|			&КЭК000
	|	КОНЕЦ													КАК КЭК,
	|	ВЫБОР 
	|		КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|			ИФО
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)
	|	КОНЕЦ													КАК ИФО,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Контрагенты) ТОГДА
	|			Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Контрагенты) ТОГДА
	|			Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Контрагенты) ТОГДА
	|			Субконто3
	|		
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры).Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры).Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры).Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		
	|		ИНАЧЕ
	|			Счет.Наименование
	|	КОНЕЦ													КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты).Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты).Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто3 КАК Справочник.Контрагенты).Наименование
	|		
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры).Контрагент.Наименование, """")
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры).Контрагент.Наименование, """")
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры).Контрагент.Наименование, """")
	|		
	|		ИНАЧЕ
	|			Счет.Наименование
	|	КОНЕЦ													КАК КонтрагентНаименование,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто1	КАК Справочник.Контрагенты).ТипКонтрагента.Код
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто2	КАК Справочник.Контрагенты).ТипКонтрагента.Код
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто3	КАК Справочник.Контрагенты).ТипКонтрагента.Код
	|			
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры).Контрагент.ТипКонтрагента.Код, ""0"")
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры).Контрагент.ТипКонтрагента.Код, ""0"")
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры).Контрагент.ТипКонтрагента.Код, ""0"")
	|			
	|		ИНАЧЕ
	|			""0""
	|	КОНЕЦ													КАК КонтрагентКИЕ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Договоры) ТОГДА
	|			Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Договоры) ТОГДА
	|			Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Договоры) ТОГДА
	|			Субконто3
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ													КАК Договор,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьКодЦели И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.ВидыЦелевыхСредств) ТОГДА
	|			Субконто1
	|		КОГДА &ЗаполнятьКодЦели И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.ВидыЦелевыхСредств) ТОГДА
	|			Субконто2
	|		КОГДА &ЗаполнятьКодЦели И ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.ВидыЦелевыхСредств) ТОГДА
	|			Субконто3
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.ВидыЦелевыхСредств.ПустаяСсылка)
	|	КОНЕЦ													КАК КодЦели,
	|	СУММА(СуммаОстаток)										КАК Всего,
	|	СУММА(СуммаОстаток)										КАК Подтверждено,
	|	СУММА(0)												КАК НеПодтверждено,
	|	СУММА(0)												КАК ИстекСрокДавности
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.Остатки(
	|		&ДатаЗапроса,					// 1 Период
	|		Счет В ИЕРАРХИИ(&СписокСчетов),	// 2 Условие счета
	|		,								// 3 Виды субконто
	|		Организация = &Организация
	|		И ВЫБОР 
	|			КОГДА &ИспользоватьОтборПоИФО ТОГДА
	|				ИФО = &ИФО
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|        И ВЫБОР 
	|			КОГДА &ИспользоватьОтборПоКФО ТОГДА
	|				КФО = &КФО
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ
	|		И ВЫБОР
	|			КОГДА &ИспользоватьОтборПоКонтрагенту ТОГДА
	|				ВЫБОР
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Контрагенты) ТОГДА
	|						Субконто1 В (ВЫБРАТЬ Ссылка ИЗ ОтборКонтрагентов)
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Контрагенты) ТОГДА
	|						Субконто2 В (ВЫБРАТЬ Ссылка ИЗ ОтборКонтрагентов)
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Контрагенты) ТОГДА
	|						Субконто3 В (ВЫБРАТЬ Ссылка ИЗ ОтборКонтрагентов)
	|						
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Договоры) ТОГДА
	|						ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры).Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) В (ВЫБРАТЬ Ссылка ИЗ ОтборКонтрагентов)
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Договоры) ТОГДА
	|						ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры).Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) В (ВЫБРАТЬ Ссылка ИЗ ОтборКонтрагентов)
	|					КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Договоры) ТОГДА
	|						ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры).Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) В (ВЫБРАТЬ Ссылка ИЗ ОтборКонтрагентов)
	|						
	|					ИНАЧЕ
	|						ЛОЖЬ
	|				КОНЕЦ
	|			ИНАЧЕ
	|				ИСТИНА
	|		КОНЕЦ)	КАК Остатки
	|ГДЕ
	|	ВЫБОР 
	|		КОГДА &ИспользоватьОтборПоПодразделению И Счет.УчетПоПодразделениям ТОГДА
	|			Подразделение = &Подразделение
	|		ИНАЧЕ
	|			ИСТИНА
	|	КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	Счет,
	|	Счет.Забалансовый,
	|	Счет.БезДетализацииКОСГУ,
	|	ВЫБОР
	|		КОГДА Счет.КОСГУКт = ЗНАЧЕНИЕ(Справочник.КОСГУ.ПустаяСсылка) ТОГДА
	|			""0""
	|		ИНАЧЕ
	|			ПОДСТРОКА(Счет.КОСГУКт.Код, 3, 1)
	|	КОНЕЦ,
	|	КФО,
	|	КПС,
	|	ВЫБОР
	|		КОГДА Счет.Забалансовый ТОГДА
	|			КЭК
	|		ИНАЧЕ
	|			&КЭК000
	|	КОНЕЦ,
	|	ВЫБОР 
	|		КОГДА &ИспользоватьУчетПоИФО ТОГДА
	|			ИФО
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Контрагенты) ТОГДА
	|			Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Контрагенты) ТОГДА
	|			Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Контрагенты) ТОГДА
	|			Субконто3
	|		
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры).Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры).Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры).Контрагент, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|		
	|		ИНАЧЕ
	|			Счет.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто1 КАК Справочник.Контрагенты).Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто2 КАК Справочник.Контрагенты).Наименование
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто3 КАК Справочник.Контрагенты).Наименование
	|		
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры).Контрагент.Наименование, """")
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры).Контрагент.Наименование, """")
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры).Контрагент.Наименование, """")
	|		
	|		ИНАЧЕ
	|			Счет.Наименование
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто1	КАК Справочник.Контрагенты).ТипКонтрагента.Код
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто2	КАК Справочник.Контрагенты).ТипКонтрагента.Код
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Контрагенты) ТОГДА
	|			ВЫРАЗИТЬ(Субконто3	КАК Справочник.Контрагенты).ТипКонтрагента.Код
	|			
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто1 КАК Справочник.Договоры).Контрагент.ТипКонтрагента.Код, ""0"")
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто2 КАК Справочник.Договоры).Контрагент.ТипКонтрагента.Код, ""0"")
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Договоры) ТОГДА
	|			ЕСТЬNULL(ВЫРАЗИТЬ(Субконто3 КАК Справочник.Договоры).Контрагент.ТипКонтрагента.Код, ""0"")
	|			
	|		ИНАЧЕ
	|			""0""
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.Договоры) ТОГДА
	|			Субконто1
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.Договоры) ТОГДА
	|			Субконто2
	|		КОГДА ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.Договоры) ТОГДА
	|			Субконто3
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА &ЗаполнятьКодЦели И ТИПЗНАЧЕНИЯ(Субконто1) = ТИП(Справочник.ВидыЦелевыхСредств) ТОГДА
	|			Субконто1
	|		КОГДА &ЗаполнятьКодЦели И ТИПЗНАЧЕНИЯ(Субконто2) = ТИП(Справочник.ВидыЦелевыхСредств) ТОГДА
	|			Субконто2
	|		КОГДА &ЗаполнятьКодЦели И ТИПЗНАЧЕНИЯ(Субконто3) = ТИП(Справочник.ВидыЦелевыхСредств) ТОГДА
	|			Субконто3
	|		ИНАЧЕ
	|			ЗНАЧЕНИЕ(Справочник.ВидыЦелевыхСредств.ПустаяСсылка)
	|	КОНЕЦ
	|ИМЕЮЩИЕ
	|	СУММА(СуммаОстаток) <> 0
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименование, " + ?(ДокументОбъект.РежимЗаполнения = 1, "Договор,", "") + "
	|	Договор,
	|	Счет.Порядок,
	|	КФО.Порядок
	|;";
	
	ТаблицаЗадолженность = ЗапросЗаполнение.Выполнить().Выгрузить();
	
	Если ДокументОбъект.ДатаИнвентаризации >= Дата(2020,12,31) Тогда
		ИнвентаризацияСервер.ЗаполнитьКЭКОстатков(ТаблицаЗадолженность);
	КонецЕсли;
	
	ДополнительныеПараметры = ИнвентаризацияСервер.ПараметрыЗаполненияДолгосрочнойЗадолженностиИнвентаризации();
	ДополнительныеПараметры.ВидЗадолженности						= Перечисления.ВидыЗадолженности.Дебиторская;
	ДополнительныеПараметры.ИспользоватьУчетПоИФО					= ИспользоватьУчетПоИФО;
	ДополнительныеПараметры.ИспользоватьКонтрольИсполненияДоговоров	= ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольИсполненияДоговоров");
	
	ИнвентаризацияСервер.ЗаполнитьДолгосрочнуюЗадолженностьИнвентаризации(ТаблицаЗадолженность, ДокументОбъект, ДополнительныеПараметры);
	
	Если РежимЗаполнения > 0 Тогда
		ПараметрыПоискаОборотов = ИнвентаризацияСервер.ПолучитьПустыеПараметрыПоискаОборотовСНачалаГода();
		ПараметрыПоискаОборотов.Организация							= ДокументОбъект.Организация;
		ПараметрыПоискаОборотов.ДатаИнвентаризации					= ДокументОбъект.ДатаИнвентаризации;
		ПараметрыПоискаОборотов.ИспользоватьУчетПоИФО				= ИспользоватьУчетПоИФО;
		ПараметрыПоискаОборотов.ИспользоватьУчетПоПодразделениям	= ИспользоватьУчетПоПодразделениям;
		
		ИнвентаризацияСервер.ОставитьОстаткиТолькоПросроченнойЗадолженности52н(ТаблицаЗадолженность, ПараметрыПоискаОборотов, РежимЗаполнения);
	КонецЕсли;
	
	ДокументОбъект["Задолженность"].Загрузить(ТаблицаЗадолженность);
	
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, СтруктураДополнительныеСвойства) Экспорт
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"Организация,Дата,ДатаИнвентаризации,РежимЗаполнения");
	
	//по счетам 205, 208, 209 отрицательные суммы это Кредиторская задолженность
	МассивАПСчетов = БухгалтерскийУчет.СписокСчетов("205.00, 208.00, 209.00"); 
	
	ФормироватьДвиженияДолгосрочнойПросроченной = РегистрыСведений.ДолгосрочнаяПросроченнаяЗадолженность.РазрешеноФормированиеДвиженийСтороннимиДокументами(ЗначенияРеквизитов.ДатаИнвентаризации);
	
	Если Не ФормироватьДвиженияДолгосрочнойПросроченной Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",					ДокументСсылка);
	Запрос.УстановитьПараметр("ДатаИнвентаризации",		НачалоДня(ЗначенияРеквизитов.ДатаИнвентаризации));
	Запрос.УстановитьПараметр("ДатаНачалоГода",			НачалоГода(ЗначенияРеквизитов.ДатаИнвентаризации));
	Запрос.УстановитьПараметр("Организация",			ЗначенияРеквизитов.Организация);
	Запрос.УстановитьПараметр("Дебиторская",			Перечисления.ВидыЗадолженности.Дебиторская);
	Запрос.УстановитьПараметр("Кредиторская",			Перечисления.ВидыЗадолженности.Кредиторская);
	Запрос.УстановитьПараметр("МассивАПСчетов",			МассивАПСчетов);
	Запрос.УстановитьПараметр("ДетализацияПоДоговорам",	ЗначенияРеквизитов.РежимЗаполнения = 1);
	
	Запрос.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Движения по регистру сведений ДолгосрочнаяПросроченнаяЗадолженность
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	&ДатаИнвентаризации КАК Период,
	|	&ДатаИнвентаризации КАК ДатаИнвентаризации,
	|	&Организация КАК Организация,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Счет КАК СчетРасчетов,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Счет В (&МассивАПСчетов)
	|				И (ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Долгосрочная < 0
	|					ИЛИ ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Просроченная < 0)
	|			ТОГДА &Кредиторская
	|		ИНАЧЕ &Дебиторская
	|	КОНЕЦ КАК ВидЗадолженности,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.ИФО КАК ИФО,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.КФО КАК КФО,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.КПС КАК КПС,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.КЭК КАК КЭК,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА &ДетализацияПоДоговорам
	|			ТОГДА ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Договор
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Договоры.ПустаяСсылка)
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Счет В (&МассивАПСчетов)
	|				И ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Долгосрочная < 0
	|			ТОГДА -ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Долгосрочная
	|		ИНАЧЕ ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Долгосрочная
	|	КОНЕЦ КАК Долгосрочная,
	|	ВЫБОР
	|		КОГДА ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Счет В (&МассивАПСчетов)
	|				И ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Просроченная < 0
	|			ТОГДА -ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Просроченная
	|		ИНАЧЕ ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Просроченная
	|	КОНЕЦ КАК Просроченная,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.ДатаВозникновения КАК ДатаВозникновения,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.ДатаИсполнения КАК ДатаИсполнения,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.ПричинаОбразованияКод КАК ПричинаОбразованияКод,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.ПричинаОбразованияПояснение КАК ПричинаОбразованияПояснение,
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.ПричинаОбразованияДополнительно КАК ПричинаОбразованияДополнительно
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовПоПоступлениям.Задолженность КАК ИнвентаризацияРасчетовПоПоступлениямЗадолженность
	|ГДЕ
	|	ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Ссылка = &Ссылка
	|	И (&ДатаИнвентаризации = &ДатаНачалоГода
	|			ИЛИ (ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Долгосрочная <> 0
	|				ИЛИ ИнвентаризацияРасчетовПоПоступлениямЗадолженность.Просроченная <> 0))";
	
	Результат = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ДолгосрочнаяПросроченнаяЗадолженность", Результат.Выгрузить());
	
КонецПроцедуры

// Флажок <без ограничения>
Функция ФлажокБезОграничения_ПолучитьНастройкиМеханизма() Экспорт
	
	НастройкиМеханизма = Новый Структура();
	НастройкиМеханизма.Вставить("ИмяРеквизитаСсылка",	"ИФО");
	НастройкиМеханизма.Вставить("ИмяРеквизитаФлажок",	"БезУчетаИФО");
	
	Возврат НастройкиМеханизма;
	
КонецФункции

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Форма 0504091
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0504091_103н";
	КомандаПечати.Представление = НСтр("ru='Инв. опись (ф. 0504091) (в ред.103н)'");
	
	// Форма 0504091 расширенная (долгосрочная и просроченная задолженности)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0504091Расширенная_103н";
	КомандаПечати.Представление = НСтр("ru='Инв. опись (ф. 0504091) расширенная (в ред.103н)'");
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Форма0504091";
	КомандаПечати.Представление = НСтр("ru='Инв. опись (ф. 0504091)'");
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0504091_103н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0504091_103н",
			"Инвентаризационная опись расчетов по поступлениям (ф. 0504091)",
			ПечатьФормы0504091(МассивОбъектов, ОбъектыПечати, "103н"));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0504091Расширенная_103н") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0504091Расширенная_103н",
			"Инвентаризационная опись расчетов по поступлениям расширенная (ф. 0504091)",
			ПечатьФормы0504091(МассивОбъектов, ОбъектыПечати, "103н", Истина));
		
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Форма0504091") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Форма0504091",
			"Инвентаризационная опись расчетов по поступлениям (ф. 0504091)",
			ПечатьФормы0504091(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
		
КонецПроцедуры // Печать()

Функция СчетаРасчетовССубконтоДоговоры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЕПСБУВидыСубконто.Ссылка КАК Ссылка
	|ИЗ
	|	ПланСчетов.ЕПСБУ.ВидыСубконто КАК ЕПСБУВидыСубконто
	|ГДЕ
	|	ЕПСБУВидыСубконто.Ссылка В(&СчетаРасчетов)
	|	И ЕПСБУВидыСубконто.ВидСубконто = ЗНАЧЕНИЕ(ПланВИдовХарактеристик.ВидыСубконто.Договоры)";
	
	Запрос.УстановитьПараметр("СчетаРасчетов", ПолучитьСписокСчетовПоУмолчанию(Ложь));
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

// ИнтернетПоддержкаПользователей.РаботаСКонтрагентами
Процедура СформироватьОписаниеДокументовСТабличнымиЧастями(Форма, Описание) Экспорт
	
	ПроверкаКонтрагентов.ДополнитьОписаниеТабличныхЧастей(
	Форма, Описание, "Задолженность", "ЗадолженностьКонтрагент", "");
	ПроверкаКонтрагентов.ДополнитьОписаниеТабличныхЧастей(
	Форма, Описание, "СписокКонтрагентов", "СписокКонтрагентовКонтрагент", "");

КонецПроцедуры
// Конец ИнтернетПоддержкаПользователей.РаботаСКонтрагентами

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаВыбора" Тогда
		//чтобы при программном открытии формы выбора установился режим выбора
		Параметры.Вставить("РежимВыбора", Истина);
		ВыбраннаяФорма = Метаданные.Документы.ИнвентаризацияРасчетовПоПоступлениям.Формы.ФормаСписка;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьМассивЗаполненныхЗначений(ТабличнаяЧасть, ИмяКолонки)
	
	МассивЗначений = Новый Массив();
	
	Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
		
		Значение = СтрокаТаблицы[ИмяКолонки];
		
		Если ЗначениеЗаполнено(Значение) Тогда
			
			МассивЗначений.Добавить(Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивЗначений;
	
КонецФункции

Функция ПолучитьСписокСчетовПоУмолчанию(БезУчетаИерархии = Истина)
	
	Возврат БухгалтерскийУчет.СписокСчетов("205.00,207.00,209.00,210.05,04",, БезУчетаИерархии);
	
КонецФункции

// Форма 0504091 (инвентаризационная опись расчетов по поступлениям)
Функция	ПечатьФормы0504091(МассивСсылок, ОбъектыПечати, РедакцияПечатнойФормы = Неопределено, Расширенная = Ложь)
	
	Если РедакцияПечатнойФормы = "103н" Тогда
		
		Если Расширенная Тогда
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияРасчетовПоПоступлениям.ПФ_MXL_Ф0504091_Расширенная_103н");
			
			КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовПоПоступлениям_ф0504091_Расширенная_103н";
		Иначе
			Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияРасчетовПоПоступлениям.ПФ_MXL_Ф0504091_103н");
			
			КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовПоПоступлениям_ф0504091_103н";
		КонецЕсли;
		
	Иначе
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИнвентаризацияРасчетовПоПоступлениям.ПФ_MXL_Ф0504091");
		
		КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ИнвентаризацияРасчетовПоПоступлениям_ф0504091";
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб				= Истина;
	ТабДокумент.ОриентацияСтраницы		= ОриентацияСтраницы.Портрет;
	ТабДокумент.КлючПараметровПечати	= КлючПараметровПечати;
	
	ИспользоватьУчетПоИФО = ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоИФО");
	
	Запросы = Новый Запрос;
	Запросы.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запросы.УстановитьПараметр("ТекстБезОграниченияКФО", НСтр("ru='без ограничения'"));
	Запросы.УстановитьПараметр("ТекстБезОграниченияИФО", НСтр("ru='без ограничения'"));
	Запросы.УстановитьПараметр("ТекстПустоеЗначениеИФО", НСтр("ru='<пустое значение>'"));
	
	Запросы.Текст = "
	|////////////////////////////////////////////////////////////////////////////////
	|// [0]. Шапка документа
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Док.Ссылка							КАК ДокСсылка,
	|	Док.Дата							КАК Дата,
	|	Док.ДатаИнвентаризации				КАК ДатаИнвентаризации,
	|	Док.Номер							КАК Номер,
	|	Док.Организация						КАК Организация,
	|	Док.Организация.НаименованиеПолное	КАК НаименованиеОрганизации,
	|	Док.Организация.КодОКПО				КАК КодОКПО,
	|	Док.Подразделение.Наименование		КАК ПодразделениеНаименование,
	|	Док.НомерПриказаИнвентаризации		КАК НомерПриказа,
	|	Док.ДатаПриказаИнвентаризации		КАК ДатаПриказа,
	|	Док.ДатаНачала						КАК ДатаНачала,
	|	Док.ДатаОкончания					КАК ДатаОкончания,
	|	Док.ДолжностьПредседателяКомиссии	КАК ДолжностьПредседателяКомиссии,
	|	Док.ФамилияПредседателяКомиссии		КАК ФамилияПредседателяКомиссии,
	|	Док.ИмяПредседателяКомиссии			КАК ИмяПредседателяКомиссии,
	|	Док.ОтчествоПредседателяКомиссии	КАК ОтчествоПредседателяКомиссии,
	|	Док.МестоИнвентаризации				КАК МестоИнвентаризации,
	|	
	|	Док.ГруппироватьПоКонтрагентам		КАК ГруппироватьПоКонтрагентам,
	|	Док.ЗаключениеКомиссии				КАК ЗаключениеКомиссии,
	|	Док.ДатаПодписиКомиссии				КАК ДатаПодписиКомиссии,
	|	
	|	// Часть отбора:
	|	Док.ПечататьОтбор					КАК ПечататьОтбор,
	|	ВЫБОР
	|		КОГДА Док.КФО = ЗНАЧЕНИЕ(Перечисление.КВД.ПустаяСсылка) ТОГДА
	|			&ТекстБезОграниченияКФО
	|		ИНАЧЕ
	|			Док.КФО
	|	КОНЕЦ								КАК ОтборКФО,
	|	ВЫБОР
	|		КОГДА Док.БезУчетаИФО = ИСТИНА ТОГДА
	|			&ТекстБезОграниченияИФО
	|		ИНАЧЕ
	|			ВЫБОР
	|				КОГДА Док.ИФО = ЗНАЧЕНИЕ(Справочник.ИсточникиФинансовогоОбеспечения.ПустаяСсылка) ТОГДА
	|					&ТекстПустоеЗначениеИФО
	|				ИНАЧЕ
	|					Док.ИФО
	|			КОНЕЦ
	|	КОНЕЦ								КАК ОтборИФО
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовПоПоступлениям	КАК Док
	|ГДЕ
	|	Док.Ссылка В (&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер
	|ИТОГИ ПО
	|	// Обязательно первые итоги по ссылке на документ:
	|	ДокСсылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [1]. Таблица инвентаризационной комиссии
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Ссылка					КАК ДокСсылка,
	|	ТЧ.ДолжностьЧленаКомиссии	КАК ДолжностьЧленаКомиссии,
	|	ТЧ.ФамилияЧленаКомиссии		КАК ФамилияЧленаКомиссии,
	|	ТЧ.ИмяЧленаКомиссии			КАК ИмяЧленаКомиссии,
	|	ТЧ.ОтчествоЧленаКомиссии	КАК ОтчествоЧленаКомиссии
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовПоПоступлениям.СоставКомиссии	КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В (&МассивСсылок)
	|ИТОГИ ПО
	|	// Обязательно первые итоги по ссылке на документ:
	|	ТЧ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [2]. Таблица данных документа
	|//
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТЧ.Ссылка									КАК ДокСсылка,
	|	ТЧ.НомерСтроки								КАК НомерСтроки,
	|	ТЧ.Контрагент								КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ТЧ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его:
	|		КОГДА НЕ ТЧ.Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			ТЧ.Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное:
	|		КОГДА ТЧ.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ ТЧ.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(ТЧ.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			ТЧ.Контрагент.Наименование
	|	КОНЕЦ										КАК КонтрагентНаименование,
	|	ВЫБОР
	|		КОГДА НЕ Ссылка.ГруппироватьПоКонтрагентам ТОГДА
	|			ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|		ИНАЧЕ
	|			Контрагент
	|	КОНЕЦ										КАК КонтрагентДляГруппировки,
	|	ВЫБОР
	|		КОГДА НЕ Ссылка.ГруппироватьПоКонтрагентам ТОГДА
	|			""""
	|		
	|		// Далее аналогично полю КонтрагентНаименование
	|		КОГДА ТЧ.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) ТОГДА
	|			""""
	|		// Если задано наименование для печати - используем его:
	|		КОГДА НЕ ТЧ.Контрагент.НаименованиеСокращенное = """" ТОГДА
	|			ТЧ.Контрагент.НаименованиеСокращенное
	|			
	|		// Для юридических лиц есть реквизит НаименованиеПолное:
	|		КОГДА ТЧ.Контрагент.ВидКонтрагента = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ЮрЛицо)
	|			И НЕ ТЧ.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное = """" ТОГДА
	|			ВЫРАЗИТЬ(ТЧ.Контрагент.ЮридическоеФизическоеЛицо.НаименованиеПолное	КАК СТРОКА(1000))
	|			
	|		ИНАЧЕ
	|			ТЧ.Контрагент.Наименование
	|	КОНЕЦ										КАК КонтрагентНаименованиеДляУпорядочивания,
	|	ВЫБОР
	|		КОГДА Ссылка.РежимЗаполнения = 0 ТОГДА
	|			""""
	|		ИНАЧЕ
	|			Договор.Наименование
	|	КОНЕЦ										КАК ДоговорНаименование,
	|	ЕСТЬNULL(ТЧ.КодЦели.Код, """")				КАК КодЦели,
	|	ТЧ.Счет										КАК Счет,
	|	ТЧ.КФО										КАК КФО,
	|	ТЧ.КПС										КАК КПС,
	|	ТЧ.КЭК										КАК КЭК,
	|	ТЧ.ИФО										КАК ИФО,
	|	ТЧ.ДатаВозникновения						КАК ДатаВозникновения,
	|	ТЧ.ДатаИсполнения							КАК ДатаИсполнения,
	|	ТЧ.Долгосрочная								КАК Долгосрочная,
	|	ТЧ.Просроченная								КАК Просроченная,
	|	ТЧ.Всего									КАК Всего,
	|	ТЧ.Подтверждено								КАК Подтверждено,
	|	ТЧ.НеПодтверждено							КАК НеПодтверждено,
	|	ТЧ.ИстекСрокДавности						КАК ИстекСрокДавности
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовПоПоступлениям.Задолженность КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В(&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	КонтрагентНаименованиеДляУпорядочивания,
	|	НомерСтроки
	|ИТОГИ
	|	СУММА(Всего),
	|	СУММА(Подтверждено),
	|	СУММА(НеПодтверждено),
	|	СУММА(ИстекСрокДавности),
	|	СУММА(Долгосрочная),
	|	СУММА(Просроченная)
	|ПО
	|	// Обязательно первые итоги по ссылке на документ:
	|	ДокСсылка,
	|	КонтрагентДляГруппировки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [3]. Список счетов (для вывода отбора по счетам)
	|//
	|ВЫБРАТЬ
	|	ТЧ.Ссылка						КАК ДокСсылка,
	|	ТЧ.Счет							КАК Счет,
	|	ВЫБОР
	|		КОГДА ТЧ.Счет В	(
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ЕПСБУ.Родитель
	|			ИЗ
	|				ПланСчетов.ЕПСБУ	КАК ЕПСБУ
	|			ГДЕ
	|				ЕПСБУ.Родитель = ТЧ.Счет)	ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ							КАК ЭтоГруппа
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовПоПоступлениям.СписокСчетов	КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В (&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	ТЧ.Счет.Порядок
	|ИТОГИ ПО
	|	// Обязательно первые итоги по ссылке на документ:
	|	ТЧ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|// [4]. Список контрагентов (для вывода отбора по контрагентам)
	|//
	|ВЫБРАТЬ
	|	ТЧ.Ссылка						КАК ДокСсылка,
	|	ТЧ.Контрагент					КАК Контрагент,
	|	ТЧ.Контрагент.ЭтоГруппа			КАК ЭтоГруппа
	|ИЗ
	|	Документ.ИнвентаризацияРасчетовПоПоступлениям.СписокКонтрагентов	КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка В (&МассивСсылок)
	|УПОРЯДОЧИТЬ ПО
	|	ТЧ.Контрагент.ЭтоГруппа			УБЫВ,
	|	ТЧ.Контрагент.Наименование
	|ИТОГИ ПО
	|	// Обязательно первые итоги по ссылке на документ:
	|	ТЧ.Ссылка
	|;";
	
	Результаты = Запросы.ВыполнитьПакет();
	
	ВыборкаДокШапка				= Результаты[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДокКомиссия			= Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДокТаблица			= Результаты[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДокОтборСчета		= Результаты[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаДокОтборКонтрагенты	= Результаты[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПараметрыВывода = ПолучитьПараметрыВывода();
	
	ПараметрыВывода.Вставить("ТабличныйДокумент", ТабДокумент);
	
	СтатистикаВывода = ИнициализироватьСтатистикуВывода(ТабДокумент);
	
	// Выборки по документам:
	ПервыйДокумент = Истина;
	Пока ВыборкаДокШапка.Следующий() Цикл
		
		// Используемые области макета:
		Области = Новый Структура();
		Области.Вставить("Титул1",				Макет.ПолучитьОбласть("Титул1"));
		Области.Вставить("Титул2",				Макет.ПолучитьОбласть("Титул2"));
		Области.Вставить("ОтборКФО",			Макет.ПолучитьОбласть("ОтборКФО"));
		Области.Вставить("ОтборИФО",			Макет.ПолучитьОбласть("ОтборИФО"));
		Области.Вставить("ОтборСчетов",			Макет.ПолучитьОбласть("ОтборСчетов"));
		Области.Вставить("ОтборКонтрагентов",	Макет.ПолучитьОбласть("ОтборКонтрагентов"));
		Области.Вставить("Комиссия",			Макет.ПолучитьОбласть("Комиссия"));
		Области.Вставить("ДатаПодписиКомиссии",	Макет.ПолучитьОбласть("ДатаПодписиКомиссии"));
		Области.Вставить("ЗаголовокСтраницы",	Макет.ПолучитьОбласть("ЗаголовокСтраницы"));
		Области.Вставить("ШапкаТаблицы",		Макет.ПолучитьОбласть("ШапкаТаблицы"));
		Области.Вставить("ИтогоПоСтранице",		Макет.ПолучитьОбласть("ИтогоПоСтранице"));
		Области.Вставить("Строка",				Макет.ПолучитьОбласть("Строка"));
		Области.Вставить("СтрокаКонтрагента",	Макет.ПолучитьОбласть("СтрокаКонтрагента"));
		Области.Вставить("Итого",				Макет.ПолучитьОбласть("Итого"));
		
		// Продвигаемся в остальных выборках до текущего документа:
		ПоискТекущегоДокумента = Новый Структура("ДокСсылка", ВыборкаДокШапка["ДокСсылка"]);
		ВыборкаДокКомиссия.Сбросить();
		ВыборкаДокТаблица.Сбросить();
		ВыборкаДокОтборСчета.Сбросить();
		ВыборкаДокОтборКонтрагенты.Сбросить();
		ЕстьВыборкаДокКомиссия			= ВыборкаДокКомиссия.НайтиСледующий(ПоискТекущегоДокумента);
		ЕстьВыборкаДокТаблица			= ВыборкаДокТаблица.НайтиСледующий(ПоискТекущегоДокумента);
		ЕстьВыборкаДокОтборСчета		= ВыборкаДокОтборСчета.НайтиСледующий(ПоискТекущегоДокумента);
		ЕстьВыборкаДокОтборКонтрагенты	= ВыборкаДокОтборКонтрагенты.НайтиСледующий(ПоискТекущегоДокумента);
		
		// Выборки текущего документа:
		Выборки = Новый Структура();
		Выборки.Вставить("Данные",	ВыборкаДокТаблица);
		Выборки.Вставить("Шапка",	ВыборкаДокШапка.Выбрать());
		Выборки["Шапка"].Следующий();
		
		Если ПервыйДокумент Тогда
			ПервыйДокумент = Ложь;
		Иначе
			Если СтатистикаВывода.ПрименяетсяОдностраничныйДокумент Тогда
				ПараметрыВывода.ТабличныйДокумент.Вывести(ТабДокумент);
				
				ТабДокумент = СтатистикаВывода.ОдностраничныйДокумент;
				ТабДокумент.Очистить();
			КонецЕсли;
			
			ПараметрыВывода.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		// Запомним номер строки, с которой начали выводить текущий документ:
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		//---
		// Титул 1
		//---
		ЗначенияПараметров = Новый Структура();
		ЗначенияПараметров.Вставить("Дата", Выборки["Шапка"]["ДатаИнвентаризации"]);
		
		Области["Титул1"].Параметры.Заполнить(Выборки["Шапка"]);
		Области["Титул1"].Параметры.Заполнить(ЗначенияПараметров);
		
		ТабДокумент.Вывести(Области["Титул1"]);
		
		//---
		// Отбор
		//---
		Если Выборки["Шапка"]["ПечататьОтбор"] Тогда
			
			// 1. Текст для отбора счетов:
			Если ЕстьВыборкаДокОтборСчета Тогда
				
				Текст = "";
				
				// Цикл по конкретным счетам:
				ВыборкаОтборСчетаДетальные = ВыборкаДокОтборСчета.Выбрать();
				СтавитьЗапятую = Ложь;
				Пока ВыборкаОтборСчетаДетальные.Следующий() Цикл
					Текст = Текст
						+ ?(СтавитьЗапятую, ", ", "")
						+ ?(ВыборкаОтборСчетаДетальные["ЭтоГруппа"], "(Группа) " , "")
						+ ВыборкаОтборСчетаДетальные["Счет"];
					
					СтавитьЗапятую = Истина;
				КонецЦикла;
				
			Иначе
				Текст = НСтр("ru='счета не указаны'");
				
			КонецЕсли;
			// Заполняем значения параметров выводимой области:
			ЗначенияПараметров = Новый Структура("ОтборСчетов", Текст);
			Области["ОтборСчетов"].Параметры.Заполнить(ЗначенияПараметров);
			
			// 2. Текст для отбора контрагентов:
			Если ЕстьВыборкаДокОтборКонтрагенты Тогда
				
				Текст = "";
				СтавитьЗапятую = Ложь;
				
				ВыборкаОтборКонтрагентов = ВыборкаДокОтборКонтрагенты.Выбрать();
				Пока ВыборкаОтборКонтрагентов.Следующий() Цикл
					Текст = Текст
						+ ?(СтавитьЗапятую, ", ", "")
						+ ?(ВыборкаОтборКонтрагентов["ЭтоГруппа"], "(Группа) " , "")
						+ ВыборкаОтборКонтрагентов["Контрагент"];
					
					СтавитьЗапятую = Истина;
				КонецЦикла;	
				
			Иначе
				Текст = НСтр("ru='без ограничения'");
				
			КонецЕсли;	
			// Заполняем значения параметров выводимой области:
			ЗначенияПараметров = Новый Структура("ОтборКонтрагентов", Текст);
			Области["ОтборКонтрагентов"].Параметры.Заполнить(ЗначенияПараметров);
			
			// 3. Отборы по КФО и ИФО:
			ЗначенияПараметров = Новый Структура("ОтборКФО, ОтборИФО");
			ЗаполнитьЗначенияСвойств(ЗначенияПараметров, Выборки["Шапка"]);
			// Заполняем значения параметров выводимой области:
			Области["ОтборКФО"].Параметры.Заполнить(ЗначенияПараметров);
			Области["ОтборИФО"].Параметры.Заполнить(ЗначенияПараметров);
			
			// Выводим все области отборов:
			ТабДокумент.Вывести(Области["ОтборКФО"]);
			Если ИспользоватьУчетПоИФО Тогда
				ТабДокумент.Вывести(Области["ОтборИФО"]);
			КонецЕсли;
			ТабДокумент.Вывести(Области["ОтборСчетов"]);
			ТабДокумент.Вывести(Области["ОтборКонтрагентов"]);
			
		КонецЕсли; // ПечататьОтбор
		
		//---
		// Титул 2
		//---
		// Заполняем значения параметров выводимой области:
		Области["Титул2"].Параметры.Заполнить(Выборки["Шапка"]);
		// Выводим область:
		ТабДокумент.Вывести(Области["Титул2"]);
		
		ОбластьЗаключениеКомиссии = СформироватьЗаключениеКомиссии(Выборки["Шапка"].ЗаключениеКомиссии, Макет);
		ТабДокумент.Вывести(ОбластьЗаключениеКомиссии);
		
		//---
		// Инвентаризационная комиссия
		//---
		// Заполняем значения параметров выводимой области:
		ОбластьВсяКомиссия = УправлениеОсновнымиСредствами.СформироватьОбластьКомиссия(
			Выборки["Шапка"],
			ВыборкаДокКомиссия.Выбрать(), 
			Области["Комиссия"], 
			3);
		// Выводим область:
		ТабДокумент.Вывести(ОбластьВсяКомиссия);
		
		КомпонентыДатыДляПодписи = ИнвентаризацияСервер.ПолучитьКомпонентыДатыДляПодписи(Выборки["Шапка"]["ДатаПодписиКомиссии"]);
		
		ОбластьДатаПодписиКомиссии = Области["ДатаПодписиКомиссии"];
		ОбластьДатаПодписиКомиссии.Параметры.Заполнить(КомпонентыДатыДляПодписи);
		ТабДокумент.Вывести(ОбластьДатаПодписиКомиссии);
		
		ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		//---
		// Страница 2 и далее
		//---
		СтатистикаВывода["НомерСтраницы"] = 2;
		
		ИнициализироватьВыборки(Выборки);
		ИнициализироватьСтатистикуВывода_ТекущаяТаблица(Выборки, СтатистикаВывода);
		
		//---
		// Заголовок раздела задолженности
		//---
		ВыводимыеОбласти	= Новый Массив();
		ПроверяемыеОбласти	= Новый Массив();
		ПолучитьЗаполненныеОбласти_ЗаголовокРаздела(Области, Выборки, ПараметрыВывода, СтатистикаВывода, ВыводимыеОбласти, ПроверяемыеОбласти);
		ОбщегоНазначенияБГУ.ДобавитьМассив(ПроверяемыеОбласти, ВыводимыеОбласти);
		Если ПараметрыВывода["КонтролироватьРазрывСтраниц"] Тогда
			Если НЕ ТабДокумент.ПроверитьВывод(ПроверяемыеОбласти) Тогда
				//---
				// Разрыв страницы
				//---
				НачатьНовуюСтраницу(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода, Ложь); // ВывестиШапкуТаблицы
			КонецЕсли;
		КонецЕсли;
		Для Каждого ВыводимаяОбласть Из ВыводимыеОбласти Цикл
			ТабДокумент.Вывести(ВыводимаяОбласть);
		КонецЦикла;
		
		//---
		// Шапка таблицы
		//---
		ВывестиШапкуТаблицы(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода);
		
		//---
		// Строки
		//---
		ИнициализироватьСтатистикуВывода_ТекущаяТаблица(Выборки, СтатистикаВывода);
		// Обход по Контрагентам:
		Выборки["Контрагент"].Сбросить();
		Пока Выборки["Контрагент"].Следующий() Цикл
			Выборки.Вставить("ДетальныеЗаписи", Выборки["Контрагент"].Выбрать());
			
			ИнициализироватьСтатистикуВывода_ГруппировкаКонтрагент(Выборки, СтатистикаВывода);
			
			// Обход по детальным записям:
			Пока Выборки["ДетальныеЗаписи"].Следующий() Цикл
				
				ВыводимыеОбласти	= Новый Массив();
				ПроверяемыеОбласти	= Новый Массив();
				ПолучитьЗаполненныеОбласти_СтрокаТаблицы(Области, Выборки, ПараметрыВывода, СтатистикаВывода, Ложь, ВыводимыеОбласти, ПроверяемыеОбласти); // ЭтоПроверкаВывода
				ОбщегоНазначенияБГУ.ДобавитьМассив(ПроверяемыеОбласти, ВыводимыеОбласти);
				
				Если ПараметрыВывода["КонтролироватьРазрывСтраниц"] Тогда
					Если НЕ ТабДокумент.ПроверитьВывод(ПроверяемыеОбласти) Тогда
						//---
						// Итого по странице
						//---
						Если ПараметрыВывода["ВыводитьИтогиПоСтранице"] Тогда
							Области["ИтогоПоСтранице"] = ПолучитьЗаполненнуюОбластьИтогоПоСтранице(Области, ПараметрыВывода, СтатистикаВывода, Ложь); // ЭтоПроверкаВывода
							ТабДокумент.Вывести(Области["ИтогоПоСтранице"]);
						КонецЕсли;
						
						//---
						// Разрыв страницы
						//---
						НачатьНовуюСтраницу(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода, Истина); // ВывестиШапкуТаблицы
					КонецЕсли;
				КонецЕсли;
				Для Каждого ВыводимаяОбласть Из ВыводимыеОбласти Цикл
					ТабДокумент.Вывести(ВыводимаяОбласть);
				КонецЦикла;
				
				ОбновитьИтогиПоСтранице(Выборки, ПараметрыВывода, СтатистикаВывода, Ложь); // ЭтоПроверкаВывода
			КонецЦикла;
		КонецЦикла;
		
		//---
		// Итого
		//---
		ВывестиИтогоПоТаблице(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода);
		
		Если СтатистикаВывода.ПрименяетсяОдностраничныйДокумент Тогда
			ПараметрыВывода.ТабличныйДокумент.Вывести(ТабДокумент);
			
			ТабДокумент = СтатистикаВывода.ОдностраничныйДокумент;
			ТабДокумент.Очистить();
		КонецЕсли;
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ПараметрыВывода.ТабличныйДокумент,
			НомерСтрокиНачало,
			ОбъектыПечати,
			Выборки["Шапка"]["ДокСсылка"]);
		
	КонецЦикла; // ВыборкаДокШапка	
	
	// Колонтитулы:
	ПараметрыВывода.ТабличныйДокумент.ВерхнийКолонтитул.Выводить			= Истина;
	ПараметрыВывода.ТабличныйДокумент.ВерхнийКолонтитул.НачальнаяСтраница	= 2;
	ПараметрыВывода.ТабличныйДокумент.ВерхнийКолонтитул.ТекстСправа		= НСтр("ru='Форма 0504091 с.[&НомерСтраницы]'");
	
	Возврат ПараметрыВывода.ТабличныйДокумент;
	
КонецФункции

// ПАРАМЕТРЫ ВЫВОДА

Функция ПолучитьПараметрыВывода()
	
	ПараметрыВывода = Новый Структура();
	ПараметрыВывода.Вставить("КонтролироватьРазрывСтраниц",	Истина);
	ПараметрыВывода.Вставить("ВыводитьИтогиПоСтранице",		Истина);
	ПараметрыВывода.Вставить("РазрешитьРазрывШапкиИСтрок",	Ложь);
	ПараметрыВывода.Вставить("РазрешитьРазрывСтрокИИтогов",	Ложь);
	
	Возврат ПараметрыВывода;
	
КонецФункции

// ВЫВОД ОБЛАСТЕЙ

Процедура ИнициализироватьВыборки(Выборки)
	
	// Группировка "Контрагент":
	Выборка = Выборки["Данные"].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Выборка.Следующий();
	Выборки.Вставить("Контрагент", Выборка);
	
	// Детальные записи:
	Выборка = Выборки["Контрагент"].Выбрать();
	Выборка.Следующий();
	Выборки.Вставить("ДетальныеЗаписи",	Выборка);
	
КонецПроцедуры

Процедура ВывестиШапкуТаблицы(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода)
	
	ВыводимыеОбласти	= Новый Массив();
	ПроверяемыеОбласти	= Новый Массив();
	ПолучитьЗаполненныеОбласти_ШапкаТаблицы(Области, Выборки, ПараметрыВывода, СтатистикаВывода, Истина, ВыводимыеОбласти, ПроверяемыеОбласти); // ЭтоПроверкаВывода
	Если ПараметрыВывода["КонтролироватьРазрывСтраниц"] Тогда
		Если НЕ ТабДокумент.ПроверитьВывод(ПроверяемыеОбласти) Тогда
			//---
			// Разрыв страницы
			//---
			НачатьНовуюСтраницу(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода, Ложь); // ВывестиШапкуТаблицы
		КонецЕсли;
	КонецЕсли;
	Для Каждого ВыводимаяОбласть Из ВыводимыеОбласти Цикл
		ТабДокумент.Вывести(ВыводимаяОбласть);
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиИтогоПоТаблице(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода)
	
	ВыводимыеОбласти	= Новый Массив();
	ПроверяемыеОбласти	= Новый Массив();
	ПолучитьЗаполненныеОбласти_ИтогоТаблицы(Области, Выборки, ПараметрыВывода, СтатистикаВывода, Ложь, ВыводимыеОбласти, ПроверяемыеОбласти); // ЭтоПроверкаВывода
	ОбщегоНазначенияБГУ.ДобавитьМассив(ПроверяемыеОбласти, ВыводимыеОбласти);
	
	Если ПараметрыВывода["КонтролироватьРазрывСтраниц"] Тогда
		Если НЕ ТабДокумент.ПроверитьВывод(ПроверяемыеОбласти) Тогда
			//---
			// Разрыв страницы
			//---
			НачатьНовуюСтраницу(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода, Истина); // ВывестиШапкуТаблицы
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ВыводимаяОбласть Из ВыводимыеОбласти Цикл
		ТабДокумент.Вывести(ВыводимаяОбласть);
	КонецЦикла;
	
КонецПроцедуры

Процедура НачатьНовуюСтраницу(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода, ВывестиШапкуТаблицы)
	
	Если СтатистикаВывода.ПрименяетсяОдностраничныйДокумент Тогда
		ПараметрыВывода.ТабличныйДокумент.Вывести(ТабДокумент);
	КонецЕсли;
	
	ПараметрыВывода.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДокумент = СтатистикаВывода.ОдностраничныйДокумент;
	ТабДокумент.Очистить();
	
	СтатистикаВывода.ПрименяетсяОдностраничныйДокумент = Истина;
	
	СтатистикаВывода["НомерСтраницы"]						= СтатистикаВывода["НомерСтраницы"] + 1;
	СтатистикаВывода["ТекущаяТаблица"]["ИтогоПоСтранице"]	= ПолучитьПустыеИтогиПоСтранице();
	
	Если ВывестиШапкуТаблицы Тогда
		ВывестиШапкуТаблицы(ТабДокумент, Области, Выборки, ПараметрыВывода, СтатистикаВывода);
		СтатистикаВывода["ТекущаяТаблица"]["КоличествоСтраниц"]	= СтатистикаВывода["ТекущаяТаблица"]["КоличествоСтраниц"] + 1;
	КонецЕсли;
	
КонецПроцедуры

// ЗАПОЛНЕНИЕ ОБЛАСТЕЙ

Процедура ПолучитьЗаполненныеОбласти_ЗаголовокРаздела(Области, Выборки, ПараметрыВывода, СтатистикаВывода, ВозвратВыводимыеОбласти, ВозвратДополнительныеПроверяемыеОбласти)
	
	//---
	// Заголовок раздела
	//---
	ВозвратВыводимыеОбласти.Добавить(Области["ЗаголовокСтраницы"]);
	
	ВыводимыеДалееОбласти = Новый Массив();
	ПолучитьЗаполненныеОбласти_ШапкаТаблицы(Области, Выборки, ПараметрыВывода, СтатистикаВывода, Истина, ВыводимыеДалееОбласти, ВозвратДополнительныеПроверяемыеОбласти); // ЭтоПроверкаВывода
	Для Каждого ВыводимаяОбласть Из ВыводимыеДалееОбласти Цикл
		ВозвратДополнительныеПроверяемыеОбласти.Добавить(ВыводимаяОбласть);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПолучитьЗаполненныеОбласти_ШапкаТаблицы(Области, Выборки, ПараметрыВывода, СтатистикаВывода, ЭтоПроверкаВывода, ВозвратВыводимыеОбласти, ВозвратДополнительныеПроверяемыеОбласти)
	
	//---
	// Шапка таблицы
	//---
	ВозвратВыводимыеОбласти.Добавить(Области["ШапкаТаблицы"]);
	
	Если НЕ ПараметрыВывода["РазрешитьРазрывШапкиИСтрок"] Тогда
		ВыводимыеДалееОбласти = Новый Массив();
		ПолучитьЗаполненныеОбласти_СтрокаТаблицы(Области, Выборки, ПараметрыВывода, СтатистикаВывода, ЭтоПроверкаВывода, ВыводимыеДалееОбласти, ВозвратДополнительныеПроверяемыеОбласти);
		Для Каждого ВыводимаяОбласть Из ВыводимыеДалееОбласти Цикл
			ВозвратДополнительныеПроверяемыеОбласти.Добавить(ВыводимаяОбласть);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьЗаполненныеОбласти_СтрокаТаблицы(Области, Выборки, ПараметрыВывода, СтатистикаВывода, ЭтоПроверкаВывода, ВозвратВыводимыеОбласти, ВозвратДополнительныеПроверяемыеОбласти)
	
	Если Выборки["Шапка"]["ГруппироватьПоКонтрагентам"] И СтатистикаВывода["ТекущаяТаблица"]["НомерСтрокиКонтрагентДетальныеЗаписи"] = 0 Тогда
		//---
		// Группировка "Контрагент"
		//---
		Если НЕ ЭтоПроверкаВывода Тогда
			СтатистикаВывода["ТекущаяТаблица"]["НомерСтрокиКонтрагент"]	= СтатистикаВывода["ТекущаяТаблица"]["НомерСтрокиКонтрагент"] + 1;
			СтатистикаВывода["ТекущаяТаблица"]["НомерСтроки"]			= СтатистикаВывода["ТекущаяТаблица"]["НомерСтроки"] + 1;
			СтатистикаВывода["НомерСтроки"]								= СтатистикаВывода["НомерСтроки"] + 1;
		КонецЕсли;
		Области["СтрокаКонтрагента"].Параметры.Заполнить(Выборки["Контрагент"]);
		
		ЗначенияПараметров = Новый Структура("КонтрагентНаименование", Выборки["Контрагент"].КонтрагентДляГруппировки);
		Области["СтрокаКонтрагента"].Параметры.Заполнить(ЗначенияПараметров);
		
		ВозвратВыводимыеОбласти.Добавить(Области["СтрокаКонтрагента"]);
	КонецЕсли;
	
	//---
	// Детальная строка
	//---
	Если НЕ ЭтоПроверкаВывода Тогда
		СтатистикаВывода["ТекущаяТаблица"]["НомерСтрокиКонтрагентДетальныеЗаписи"]	= СтатистикаВывода["ТекущаяТаблица"]["НомерСтрокиКонтрагентДетальныеЗаписи"] + 1;
		СтатистикаВывода["ТекущаяТаблица"]["НомерСтроки"]							= СтатистикаВывода["ТекущаяТаблица"]["НомерСтроки"] + 1;
		СтатистикаВывода["НомерСтроки"]												= СтатистикаВывода["НомерСтроки"] + 1;
	КонецЕсли;
	
	Параметр_СчетПолный = УправлениеПечатьюБГУ.ПредставлениеРабочегоСчета(
		Выборки["ДетальныеЗаписи"]["КПС"], 
		Выборки["ДетальныеЗаписи"]["КФО"], 
		Выборки["ДетальныеЗаписи"]["Счет"], 
		?(ЗначениеЗаполнено(Выборки["ДетальныеЗаписи"]["КЭК"]), Выборки["ДетальныеЗаписи"]["КЭК"], "000"));
		
	ЗначениеПараметров = Новый Структура();
	ЗначениеПараметров.Вставить("СчетПолный",	Параметр_СчетПолный);
	
	ДоговорНаименование = Выборки["ДетальныеЗаписи"]["ДоговорНаименование"];
	Если ЗначениеЗаполнено(ДоговорНаименование) Тогда
		ЗначениеПараметров.Вставить("ДоговорНаименование",	", " + ДоговорНаименование);
	КонецЕсли;
	
	Области["Строка"].Параметры.Заполнить(Выборки["ДетальныеЗаписи"]);
	Области["Строка"].Параметры.Заполнить(ЗначениеПараметров);
	ВозвратВыводимыеОбласти.Добавить(Области["Строка"]);
	
	//---
	// Итого по странице (опционально)
	//---
	Если ПараметрыВывода["ВыводитьИтогиПоСтранице"] Тогда
		ОбновитьИтогиПоСтранице(Выборки, ПараметрыВывода, СтатистикаВывода, Истина); // ЭтоПроверкаВывода
		ВозвратДополнительныеПроверяемыеОбласти.Добавить(ПолучитьЗаполненнуюОбластьИтогоПоСтранице(Области, ПараметрыВывода, СтатистикаВывода, Истина)); // ЭтоПроверкаВывода
	КонецЕсли;
	
	//---
	// Итого (опционально)
	//---
	ЭтоПоследняяСтрока = (СтатистикаВывода["ТекущаяТаблица"]["НомерСтроки"] = СтатистикаВывода["ТекущаяТаблица"]["КоличествоСтрок"]);
	Если ЭтоПоследняяСтрока И НЕ ПараметрыВывода["РазрешитьРазрывСтрокИИтогов"] Тогда
		ВыводимыеДалееОбласти	= Новый Массив();
		ПроверяемыеДалееОбласти	= Новый Массив();
		
		ПолучитьЗаполненныеОбласти_ИтогоТаблицы(Области, Выборки, ПараметрыВывода, СтатистикаВывода, ЭтоПроверкаВывода, ВыводимыеДалееОбласти, ПроверяемыеДалееОбласти);
		ОбщегоНазначенияБГУ.ДобавитьМассив(ВозвратДополнительныеПроверяемыеОбласти, ВыводимыеДалееОбласти);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьЗаполненныеОбласти_ИтогоТаблицы(Области, Выборки, ПараметрыВывода, СтатистикаВывода, ЭтоПроверкаВывода, ВозвратВыводимыеОбласти, ВозвратДополнительныеПроверяемыеОбласти)
	
	ВозвратВыводимыеОбласти.Добавить(ПолучитьЗаполненнуюОбластьИтогоПоТаблице(Области, Выборки));
	
КонецПроцедуры

// ИТОГИ

Функция ПолучитьПустыеИтогиПоСтранице()
	
	Возврат Новый Структура("
		|Всего,
		|Подтверждено,
		|НеПодтверждено,
		|ИстекСрокДавности",
		0, 0, 0, 0);
	
КонецФункции

Функция ПолучитьЗаполненнуюОбластьИтогоПоСтранице(Области, ПараметрыВывода, СтатистикаВывода, ЭтоПроверкаВывода)
	
	Если ЭтоПроверкаВывода Тогда
		СтруктураИтогов = СтатистикаВывода["ТекущаяТаблица"]["ИтогоПоСтраницеПроверкаВывода"];
	Иначе
		СтруктураИтогов = СтатистикаВывода["ТекущаяТаблица"]["ИтогоПоСтранице"];
	КонецЕсли;
	
	Области["ИтогоПоСтранице"].Параметры.Заполнить(СтруктураИтогов);
	
	Возврат Области["ИтогоПоСтранице"];
	
КонецФункции

Функция ПолучитьЗаполненнуюОбластьИтогоПоТаблице(Области, Выборки)
	
	Области["Итого"].Параметры.Заполнить(Выборки["Данные"]);
	
	Возврат Области["Итого"];
	
КонецФункции

Процедура ОбновитьИтогиПоСтранице(Выборки, ПараметрыВывода, СтатистикаВывода, ЭтоПроверкаВывода)
	
	Если ЭтоПроверкаВывода Тогда
		СтруктураИтогов = СтатистикаВывода["ТекущаяТаблица"]["ИтогоПоСтраницеПроверкаВывода"];
	Иначе
		СтруктураИтогов = СтатистикаВывода["ТекущаяТаблица"]["ИтогоПоСтранице"];
	КонецЕсли;
	
	СтруктураИтогов["Всего"]				= СтатистикаВывода["ТекущаяТаблица"]["ИтогоПоСтранице"]["Всего"]				+ ?(ЗначениеЗаполнено(Выборки["ДетальныеЗаписи"]["Всего"]),				Выборки["ДетальныеЗаписи"]["Всего"], 0);
	СтруктураИтогов["Подтверждено"]			= СтатистикаВывода["ТекущаяТаблица"]["ИтогоПоСтранице"]["Подтверждено"]			+ ?(ЗначениеЗаполнено(Выборки["ДетальныеЗаписи"]["Подтверждено"]),		Выборки["ДетальныеЗаписи"]["Подтверждено"], 0);
	СтруктураИтогов["НеПодтверждено"]		= СтатистикаВывода["ТекущаяТаблица"]["ИтогоПоСтранице"]["НеПодтверждено"]		+ ?(ЗначениеЗаполнено(Выборки["ДетальныеЗаписи"]["НеПодтверждено"]),	Выборки["ДетальныеЗаписи"]["НеПодтверждено"], 0);
	СтруктураИтогов["ИстекСрокДавности"]	= СтатистикаВывода["ТекущаяТаблица"]["ИтогоПоСтранице"]["ИстекСрокДавности"]	+ ?(ЗначениеЗаполнено(Выборки["ДетальныеЗаписи"]["ИстекСрокДавности"]),	Выборки["ДетальныеЗаписи"]["ИстекСрокДавности"], 0);
	
КонецПроцедуры

// СТАТИСТИКА ВЫВОДА

Функция ИнициализироватьСтатистикуВывода(ТабДокумент)
	
	ОдностраничныйДокумент = Новый ТабличныйДокумент();
	ЗаполнитьЗначенияСвойств(ОдностраничныйДокумент, ТабДокумент, "КлючПараметровПечати");
	
	СтатистикаВывода = Новый Структура();
	СтатистикаВывода.Вставить("НомерСтраницы",	0);
	СтатистикаВывода.Вставить("НомерСтроки",	0);
	СтатистикаВывода.Вставить("ОдностраничныйДокумент", ОдностраничныйДокумент);
	СтатистикаВывода.Вставить("ПрименяетсяОдностраничныйДокумент", Ложь);
	
	Возврат СтатистикаВывода;
	
КонецФункции

Процедура ИнициализироватьСтатистикуВывода_ТекущаяТаблица(Выборки, СтатистикаВывода)
	
	// Подготовка:
	Если Выборки["Шапка"]["ГруппироватьПоКонтрагентам"] Тогда
		КоличествоСтрок = Выборки["Данные"].Выбрать().Количество();
	Иначе
		КоличествоСтрок = Выборки["Данные"].Выбрать().Количество()
			- Выборки["Контрагент"].Количество();
	КонецЕсли;
	
	ТекущаяТаблица = Новый Структура();
	ТекущаяТаблица.Вставить("КоличествоСтрокКонтрагентДетальныеЗаписи",	Выборки["ДетальныеЗаписи"].Количество());
	ТекущаяТаблица.Вставить("КоличествоСтрокКонтрагент",				Выборки["Контрагент"].Количество());
	ТекущаяТаблица.Вставить("КоличествоСтрок",							КоличествоСтрок);
	ТекущаяТаблица.Вставить("КоличествоСтраниц",						1);
	ТекущаяТаблица.Вставить("НомерСтрокиКонтрагентДетальныеЗаписи",		0);
	ТекущаяТаблица.Вставить("НомерСтрокиКонтрагент",					0);
	ТекущаяТаблица.Вставить("НомерСтроки",								0);
	ТекущаяТаблица.Вставить("ИтогоПоСтранице",							ПолучитьПустыеИтогиПоСтранице());
	ТекущаяТаблица.Вставить("ИтогоПоСтраницеПроверкаВывода",			ПолучитьПустыеИтогиПоСтранице());
	
	СтатистикаВывода.Вставить("ТекущаяТаблица", ТекущаяТаблица);
	
КонецПроцедуры

Процедура ИнициализироватьСтатистикуВывода_ГруппировкаКонтрагент(Выборки, СтатистикаВывода)
	
	СтатистикаВывода["ТекущаяТаблица"]["КоличествоСтрокКонтрагентДетальныеЗаписи"]	= Выборки["ДетальныеЗаписи"].Количество();
	СтатистикаВывода["ТекущаяТаблица"]["НомерСтрокиКонтрагентДетальныеЗаписи"]		= 0;
	
КонецПроцедуры

Функция СформироватьЗаключениеКомиссии(Текст, Макет)
	
	БлокиСтрок = Неопределено;
	
	// Блок 1
	ИнвентаризацияСервер.ДобавитьОписаниеБлокаСтрок(БлокиСтрок, 1, 110, "ЗаключениеКомиссииСтрока1");
	
	// Блок 2
	ИнвентаризацияСервер.ДобавитьОписаниеБлокаСтрок(БлокиСтрок, , 134, "ЗаключениеКомиссииСтрока2");
	
	МинимальноеКоличествоСтрок = 3;
	
	Возврат ИнвентаризацияСервер.РазбитьТекстНаБлокиСтрокИВывестиВТабличныйДокумент(Текст, БлокиСтрок, Макет, МинимальноеКоличествоСтрок);
	
КонецФункции

#КонецОбласти

#КонецЕсли
